Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [55]:
import pandas as pd
l=[4, 8, 15, 16, 23,42]
df1=pd.Series(l)

In [56]:
type(df1)

pandas.core.series.Series

In [58]:
for i in df1:
    print(i)

4
8
15
16
23
42

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the 
variable print it

In [59]:
l=[]
for i in range(1,11):
    l.append (i)

In [60]:
import pandas as pd
df2=pd.Series(l)

In [61]:
for i in df2:
    print(i)

1
2
3
4
5
6
7
8
9
10

Q3. Create a Pandas DataFrame that contains the following data:
    Then, print the DataFrame

In [62]:
data = {'Name': ['Alice', 'Bob', 'Clair'],

        'Age': [25, 30, 27],

        'Gender': ['Female', 'Male', 'Female']}

In [63]:
data

{'Name': ['Alice', 'Bob', 'Clair'],
 'Age': [25, 30, 27],
 'Gender': ['Female', 'Male', 'Female']}

In [64]:
df=pd.DataFrame(data)
df

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male
2  Clair   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

A pandas DataFrame is a two-dimensional data structure that can be thought of as a spreadsheet. 
It can also be thought of as a collection of two or more series with common indices.

In [32]:
data1 = {'Name': ['Alice', 'Bob', 'Clair'],

        'Age': [25, 30, 27],

        'Gender': ['Female', 'Male', 'Female']}

In [33]:
df1=pd.DataFrame(data1)
df1

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male
2  Clair   27  Female

In [34]:
df1.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

In [36]:
df1['Name']

0    Alice
1      Bob
2    Clair
Name: Name, dtype: object

In [41]:
type(df1['Name'])  #series

pandas.core.series.Series

In [42]:
type(df1[['Name','Age']]) #dataframe

pandas.core.frame.DataFrame

In [65]:
sf1=pd.Series(data1)

In [68]:
type(sf1),sf1

(pandas.core.series.Series,
 Name    [Alice, Bob, Clair]
 dtype: object)

In [69]:
data2 = {'Name': ['Alice', 'Bob', 'Clair']}

In [70]:
sf2=pd.Series(data2)

In [71]:
sf2

Name    [Alice, Bob, Clair]
dtype: object

In [72]:
type(sf2)

pandas.core.series.Series

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can 
you give an example of when you might use one of these functions?

In [ ]:
#common functions you can use to manipulate data in a Pandas DataFrame
replace(),rename(),drop()

In [13]:
import pandas as pd
data = {'Name': ['Alice', 'Bob', 'Clair'],

        'Age': [25, 30, 27],

        'Gender': ['Female', 'Male', 'Female']}
df=pd.DataFrame(data)

In [14]:
df

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male
2  Clair   27  Female

In [15]:
df1=df.rename(columns={'Name':'Name1'})

In [16]:
df1

   Name1  Age  Gender
0  Alice   25  Female
1    Bob   30    Male
2  Clair   27  Female

In [27]:
df[['Gender']].replace('Male','Female')

   Gender
0  Female
1  Female
2  Female

In [28]:
df

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male
2  Clair   27  Female

In [34]:
df.drop(columns = ['Name'])

   Age  Gender
0   25  Female
1   30    Male
2   27  Female

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [92]:
#Panel is Mutable
#Data Frame is mutable
#Series Objects are value-mutable but size-immutable objects.

Q7. Create a DataFrame using multiple Series. Explain with an example

In [86]:
data1 = ['Alice', 'Bob', 'Clair']
data2=[25, 30, 27]
data3=['Female', 'Male', 'Female']

In [87]:
sf1=pd.Series(data1)
sf2=pd.Series(data2)
sf3=pd.Series(data3)

In [88]:
sf1,type(sf1)

(0    Alice
 1      Bob
 2    Clair
 dtype: object,
 pandas.core.series.Series)

In [89]:
data={'Name':data1,'Age':data2,'Gender':data3}
df=pd.DataFrame(data)

In [90]:
df

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male
2  Clair   27  Female

In [91]:
type(df)

pandas.core.frame.DataFrame